benchmarks/logs/2026-04-29_11-20-10/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.23ms    4.21ms  48.68ms   97.28%
    Req/Sec     1.88k   300.44     3.63k    76.04%
  Latency Distribution
     50%    2.33ms
     75%    2.44ms
     90%    4.58ms
     99%   30.25ms
  112295 requests in 30.10s, 1.18GB read
  Non-2xx or 3xx responses: 227
Requests/sec:   3730.34
Transfer/sec:     40.23MB