benchmarks/logs/2026-04-29_11-20-10/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   799.77us    1.54ms  22.94ms   93.79%
    Req/Sec    10.85k     0.96k   13.70k    71.17%
  Latency Distribution
     50%  381.00us
     75%  484.00us
     90%  779.00us
     99%    8.80ms
  648353 requests in 30.02s, 669.35MB read
  Non-2xx or 3xx responses: 2315
Requests/sec:  21600.81
Transfer/sec:     22.30MB